In [9]:
import pandas as pd

In [10]:
df = pd.DataFrame({'name': ['name1', 'name2', 'name3', 'name4'], 'знач 2': [1, 2, 34, 5], 'val2': [4, 6, 2, 7]})

In [11]:
df

    name  знач 2  val2
0  name1       1     4
1  name2       2     6
2  name3      34     2
3  name4       5     7

In [12]:
df.sort_values(by='знач 2')

    name  знач 2  val2
0  name1       1     4
1  name2       2     6
3  name4       5     7
2  name3      34     2

In [13]:
df

    name  знач 2  val2
0  name1       1     4
1  name2       2     6
2  name3      34     2
3  name4       5     7

In [14]:
print(df)

    name  знач 2  val2
0  name1       1     4
1  name2       2     6
2  name3      34     2
3  name4       5     7

In [17]:
df

    name  знач 2  val2
0  name1       1     4
1  name2       2     6
2  name3      34     2
3  name4       5     7

In [18]:
len(df)

4

In [19]:
df.loc[len(df)] = ['name5', 3, 12]
df

    name  знач 2  val2
0  name1       1     4
1  name2       2     6
2  name3      34     2
3  name4       5     7
4  name5       3    12

In [20]:
df.loc[len(df)] = {'name': 'name6', 'знач 2': 15, 'val2': 56}

In [21]:
df

    name  знач 2  val2
0  name1       1     4
1  name2       2     6
2  name3      34     2
3  name4       5     7
4  name5       3    12
5  name6      15    56

In [22]:
df.columns

Index(['name', 'знач 2', 'val2'], dtype='object')

In [23]:
df['column_3'] = df['знач 2'] + df['val2']
df['static_val'] = 34
df

    name  знач 2  val2  column_3  static_val
0  name1       1     4         5          34
1  name2       2     6         8          34
2  name3      34     2        36          34
3  name4       5     7        12          34
4  name5       3    12        15          34
5  name6      15    56        71          34